TestEDT/src/Catalogs/уа_ФинансовыеИнструменты/уа_ФинансовыеИнструменты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уа_ФинансовыеИнструменты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ЦБ_ИнИнвФондов</name>
      <description>Акции (паи, доли) иностранных инвестиционных фондов</description>
    </items>
    <items>
      <name>АкцииИнАО</name>
      <description>Акции иностранных акционерных обществ</description>
    </items>
    <items>
      <name>АкцииРосАО</name>
      <description>Акции российских акционерных обществ</description>
    </items>
    <items>
      <name>ГосЦБ_НаРынкеЦБ</name>
      <description>Государственные ценные бумаги РФ, обращающиеся на рынке ценных бумаг, за исключением  облигаций внешних облигационных займов РФ</description>
    </items>
    <items>
      <name>ГосЦБ_ВыпущПравРФ</name>
      <description>Государственные ценные бумаги РФ, специально выпущенные Правительством РФ</description>
    </items>
    <items>
      <name>ГосЦБ_СубьектовРФ</name>
      <description>Государственные ценные бумаги субъектов Российской Федерации</description>
    </items>
    <items>
      <name>ДепозитныеCертификаты</name>
      <description>Депозитные сертификаты</description>
    </items>
    <items>
      <name>Депозиты</name>
      <description>Депозиты</description>
    </items>
    <items>
      <name>ИнвестиционныеПаи_ПИФ_РФ</name>
      <description>Инвестиционные паи паевых инвестиционных фондов, выданные в соответствии с законодательством РФ</description>
    </items>
    <items>
      <name>ИпотечныеСертификатыУчастияРФ</name>
      <description>Ипотечные сертификаты участия, выпущенные в соответствии с законодательством РФ об ипотечных ценных </description>
    </items>
    <items>
      <name>МНО</name>
      <description>МНО</description>
    </items>
    <items>
      <name>МуниципальныеОблигации</name>
      <description>Муниципальные облигации</description>
    </items>
    <items>
      <name>Недвижимость</name>
      <description>Недвижимость</description>
    </items>
    <items>
      <name>ОблигацииРФ</name>
      <description>Облигации внешних облигационных займов РФ</description>
    </items>
    <items>
      <name>ОблигацииИнКомОрг</name>
      <description>Облигации иностранных коммерческих организаций</description>
    </items>
    <items>
      <name>ОблигацииРосХозОбщ</name>
      <description>Облигации российских хозяйственных обществ (за исключением облигаций с ипотечным покрытием)</description>
    </items>
    <items>
      <name>ОблигацииСИпотечПокрытием</name>
      <description>Облигации с ипотечным покрытием, выпущенные в соответствии с законодательством РФ об ипотечных ценны</description>
    </items>
    <items>
      <name>Прочее</name>
      <description>Прочее</description>
    </items>
    <items>
      <name>ЦБ_МеждународныхФинОрг</name>
      <description>Ценные бумаги международных финансовых организаций</description>
    </items>
    <items>
      <name>ЦБ_ПравительствИнГосударств</name>
      <description>Ценные бумаги правительств иностранных государств</description>
    </items>
  </predefined>
  <attributes>
    <name>CFI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ISIN</name>
    <comment>International Securities Identification Number</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресВнутреннееПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаНоминала</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЦенныхБумаг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПогашения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодГосРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемВыпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассификацияЦБ</name>
    <type>
      <types>EnumRef.уа_КлассификацияЦБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦББР</name>
    <type>
      <types>EnumRef.уа_ТипыЦенныхБумагБР</types>
    </type>
  </attributes>
  <attributes>
    <name>Эмитент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияАктива</name>
    <type>
      <types>EnumRef.уа_КатегорииАктива</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексируемыйНоминал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

TestEDT/src/Enums/уа_ТипыЦенныхБумагБР/уа_ТипыЦенныхБумагБР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уа_ТипыЦенныхБумагБР</name>
  <enumValues>
    <name>BON1</name>
  </enumValues>
  <enumValues>
    <name>BON2</name>
  </enumValues>
  <enumValues>
    <name>BON3</name>
  </enumValues>
  <enumValues>
    <name>BON4</name>
  </enumValues>
  <enumValues>
    <name>BON5</name>
  </enumValues>
  <enumValues>
    <name>BON6</name>
  </enumValues>
  <enumValues>
    <name>BON7</name>
  </enumValues>
  <enumValues>
    <name>DS1</name>
  </enumValues>
  <enumValues>
    <name>DS2</name>
  </enumValues>
  <enumValues>
    <name>SHS1</name>
  </enumValues>
  <enumValues>
    <name>SHS2</name>
  </enumValues>
  <enumValues>
    <name>SHS3</name>
  </enumValues>
  <enumValues>
    <name>SHS4</name>
  </enumValues>
  <enumValues>
    <name>SHS5</name>
  </enumValues>
  <enumValues>
    <name>SHS6</name>
  </enumValues>
  <enumValues>
    <name>SHS7</name>
  </enumValues>
  <enumValues>
    <name>SHS8</name>
  </enumValues>
  <enumValues>
    <name>DR</name>
  </enumValues>
  <enumValues>
    <name>CON</name>
  </enumValues>
  <enumValues>
    <name>WTS</name>
  </enumValues>
  <enumValues>
    <name>OPNI</name>
  </enumValues>
  <enumValues>
    <name>ENC</name>
  </enumValues>
</mdclass:Enum>

TestEDT/src/Catalogs/уа_ФинансовыеИнструменты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

#КонецОбласти

#Область ПрограммныйИнтерфейс
Функция НайтиГруппуПоТипуЦББР(ТипЦББР) Экспорт	
	Если ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.BON1 Тогда 
		ГруппаФИ = Справочники.уа_ФинансовыеИнструменты.ГосЦБ_НаРынкеЦБ;
	ИначеЕсли ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.BON2  Тогда 
		ГруппаФИ = Справочники.уа_ФинансовыеИнструменты.МуниципальныеОблигации;
	ИначеЕсли ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.BON3 Или ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.BON4  Тогда
		ГруппаФИ = Справочники.уа_ФинансовыеИнструменты.ОблигацииРФ;
	ИначеЕсли ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.SHS1 Или ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.SHS3  
		Или ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.SHS2 Или ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.SHS4  Тогда 
		ГруппаФИ = Справочники.уа_ФинансовыеИнструменты.АкцииРосАО;
	Иначе
		ГруппаФИ = Справочники.уа_ФинансовыеИнструменты.Прочее;
	КонецЕсли; 
	
	Возврат ГруппаФИ;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
#КонецЕсли
